# Como usar Pandas y Python para conectarse a una BDT SQL

## PostgreSQL

### Importar Librerias

In [1]:
# importat librerias
import pandas as pd
import psycopg2 as psql

### Crear conexión

In [2]:
# conexión
# usar como mashote -> connection = psql.connect(user = "", password="",host="",port="", database="")
connection = psql.connect(user = "postgres", password="password",host="localhost",port="5432", database="transporte")

### SELECT Statement

In [3]:
select = """ SELECT * FROM pasajeros limit 100"""

### Crear DataFrame

A partir de la variable, crear un dataframe usando el comando *pd.read_sql(select,connection)

In [4]:
df = pd.read_sql(select,connection)
df.head(5)

/Users/ideasleon/anaconda3/envs/sql_connect/lib/python3.9/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   id              nombre                direccion fecha_nacimiento
0   2     Lucius Galloway      0705 Hanover Circle       2002-11-15
1   3  Alejandrina Marval  626 Loftsgordon Terrace       2019-01-08
2   4         Wilek Feeny      4482 Wayridge Court       2020-02-10
3   5    Fredrika Rollett        01 Ludington Lane       2018-08-21
4   6        Scot Furmage       651 Hayes Junction       1999-12-22

## MySQL

Este proceso también puede ser usado en Oracle

### Importat Librerias

In [58]:
# importar librerias
import pandas as pd
import sqlalchemy as sql
from sqlalchemy import create_engine

# indicar la base de datos
database_type = 'mysql'
database_psql = 'postgresql'

### Crear Conexión

In [ ]:
# crear conexión
user = ""
password =""
host =""
database = ""

conn_string = "{}://{}:{}@{}/{}".format(database_type,user,password,host,database)

connection = sql.create_engine(conn_string)

In [76]:
# crear conexión
user = "root"
password ="password@"
host ="localhost:3306"
database = "any"

conn_string = "{}://{}:{}@{}/{}".format(database_type,user,password,host,database)

print(conn_string)

#engine = create_engine(conn_string)

#connection = engine.connect()

#connection = sql.create_engine(conn_string)

mysql://root:password@@localhost:3306/any

In [70]:
select = """ SELECT * FROM 06_inventory """

In [72]:
#df = pd.read_sql(select,connection)
#df
print("No se conecta por el pass termina con @")

No se conecta por el pass termina con @

In [ ]:
#engine = create_engine(‘postgresql://username:password@localhost:port_number/database_name’)

#connection = engine.connect()

In [61]:
# crear conexión
user = "postgres"
password ="password"
host ="localhost:5432"
database = "transporte"

conn_string = "{}://{}:{}@{}/{}".format(database_psql,user,password,host,database)

## print(conn_string)
connection = sql.create_engine(conn_string)

### SELECT statement

In [62]:
# select = """ SELECT * FROM 06_inventory """
#select = """ SELECT operation_type as operation FROM operations;"""
select = """ SELECT * FROM pasajeros limit 100"""

### Crear DataFrame

In [63]:
df = pd.read_sql(select,connection)
df
#print('Hello Wourld')

     id              nombre                direccion fecha_nacimiento
0     2     Lucius Galloway      0705 Hanover Circle       2002-11-15
1     3  Alejandrina Marval  626 Loftsgordon Terrace       2019-01-08
2     4         Wilek Feeny      4482 Wayridge Court       2020-02-10
3     5    Fredrika Rollett        01 Ludington Lane       2018-08-21
4     6        Scot Furmage       651 Hayes Junction       1999-12-22
..  ...                 ...                      ...              ...
95   97       Xaviera Hanne         0 Carpenter Hill       2014-12-07
96   98    Babara Dillamore        1 Manitowish Hill       2001-03-18
97   99       Roberto Imlin           28 Barby Drive       2020-03-30
98  100         Arney Proby       367 Loeprich Place       2007-01-13
99    1                       11 Little Fleur Circle       2017-02-26

[100 rows x 4 columns]

## Best practices

### Instalar la libreria mysqlclient

### OperationalError